Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་བསྒྲག་གོ །ཚངས་པའི་འཁོར་ལོ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ།
en: I will rightly roar the lion’s roar in the midst of the assembly!

source: ལྷ་འམ། བདུད་དམ། ཚངས་པ་འམ། གཞན་སུས་ཀྱང་རུང་སྟེ། ཆོས་དང་ལྡན་པར་བསྐོར་བར་མི་ནུས་པ་བདག་གིས་རབ་ཏུ་བསྐོར་བར་བྱའོ་ཞེས་བྱ་བ་སྟེ།
en: I will turn the wheel of Brahmā that no one in the world—no virtuous ascetic, brahmin, god, demon, Brahmā, or anyone else—could previously turn in conformity with the Dharma! [

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings entails the four kinds of exact knowledge.

source: བཞི་གང་ཞེ་ན། དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་སྟེ།
en: If you ask what these four are, they comprise (1) exact knowledge of meanings, (2) exact knowledge of dharmas, (3) exact knowledge of their language and lexical explanations, and (4) exact knowledge of their eloquent expression. [

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དེ། བཅྭོ་བརྒྱད་གང་ཞེ་ན། གང་གི་ནམ་ལ་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། གང་གི་ནམ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པ། སྡུག་བསྔལ་ཟད་པར་འགྱུར་བའི་ལམ་གྱིས་རྗེས་སུ་བསྟན་ཏེ། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་དེའི་བར་དུ། དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་པ་མི་མངའོ། །ཅ་ཅོ་མི་མངའོ། །དགོངས་པ་ཉམས་པ་མི་མངའོ། །འདུ་ཤེས་སྣ་ཚོགས་མི་མངའོ། །ཐུགས་མཉམ་པར་མ་བཞག་པ་མི་མངའོ། །མ་བརྟགས་པའི་བཏང་སྙོམས་མི་མངའོ། །མོས་པ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །བརྩོན་འགྲུས་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །དགོངས་པ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings entails the eighteen distinct qualities of the buddhas.

source: །ཏིང་ངེ་འཛིན་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །ཤེས་རབ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་ཡོངས་སུ་ཉམས་པ་མི་མངའོ། །སྐུའི་ཕྲིན་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་སྟེ། ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་ངོ་། །གསུང་གི་ཕྲིན་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་སྟེ། ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་ངོ་། །ཐུགས་ཀྱི་ཕྲིན་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་སྟེ། ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་ངོ་། །འདས་པའི་དུས་ལ་མ་ཐོགས་མ་ཆགས་པའི་ཡེ་ཤེས་གཟིགས་པ་འཇུག་གོ །
en: If you ask what these eighteen are, from the night when the tathāgatas attain consummate buddhahood in unsurpassed, complete enlightenment, and from the night when they teach the path whereby living creatures, including mundane gods, demons, Brahmā deities, virtuous ascetics, and brahmins, along with gods, humans, and asuras, could put an end to suffering, until their attainment of final nirvāṇa in the expanse of nirvāṇa where no residue of the psycho-physical aggregates is left behind, (1) the tathāgatas are without clumsiness; (2) they are not noisy; (3) they are without false memories; (4) they are without differentiating perceptions; (5) they are without uncomposed minds; (6) they are without the indifference that lacks discernment; {Dt.212} (7) they do not degenerate in their resolution; (8) they do not degenerate in their perseverance; (9) they do not degenerate in their recollection; (10) they do not degenerate in their meditative stability; (11) they do not degenerate in their wisdom; (12) they do not degenerate in their liberation, nor do they degenerate in their seeing the wisdom of liberation; (13) all the activities of their bodies are preceded by wisdom and followed by wisdom; (14) all the activities of their speech are preceded by wisdom and followed by wisdom; (15) all the activities of their minds are preceded by wisdom and followed by wisdom; (16) they engage in the perception of wisdom that is unobstructed and unimpeded with respect to the past; (17) they engage in the perception of wisdom that is unobstructed and unimpeded with respect to the future; and (18) they engage in the perception of wisdom that is unobstructed and unimpeded with respect to the present.

source: མ་འོངས་པའི་དུས་ལ་མ་ཐོགས་མ་ཆགས་པའི་ཡེ་ཤེས་གཟིགས་པ་འཇུག་གོ །ད་ལྟར་བྱུང་བའི་དུས་ལ་མ་ཐོགས་མ་ཆགས་པའི་ཡེ་ཤེས་གཟིགས་པ་འཇུག་པ་སྟེ།
en: These are called the eighteen distinct qualities of the buddhas. [

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་གཟུངས་ཀྱི་སྒོ་རྣམས་ཏེ། དེ་ཡང་ཡི་གེ་མཉམ་པ་ཉིད་དང་། བརྗོད་པ་མཉམ་པ་ཉིད་དང་། ཡི་གེའི་སྒོ་དང་།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings entails the dhāraṇī gateways—that is to say, the sameness of letters, the sameness of spoken words, the gateways to the letters, and the introduction to the letters.

source: ཡི་གེ་ལ་འཇུག་པ་སྟེ། དེ་ལ་ཡི་གེའི་སྒོ་དང་། ཡི་གེ་ལ་འཇུག་པ་གང་ཞེ་ན།
en: In this regard, you may ask what are the gateways to the letters and the introduction to the letters.

source: ཨ་ཞེས་བྱ་བ་ནི་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter a is the gateway to all phenomena, suggesting that they are nonarising.

source: །ར་ཞེས་བྱ་བ་ནི་རྡུལ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ra is the gateway to all phenomena, suggesting that they are immaculate.

source: །པ་ཞེས་བྱ་བ་ནི་དོན་དམ་པ་སྟོང་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter pa is the gateway to all phenomena, suggesting that ultimate reality is empty.

source: །ཙ་ཞེས་བྱ་བ་ནི་འཆི་འཕོ་དང་སྐྱེ་བ་མི་དམིགས་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་འཆི་འཕོ་དང་སྐྱེ་བ་མེད་པས། ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ca is the gateway to all phenomena, suggesting that all phenomena are without death, transmigration, and rebirth because death, transmigration, and rebirth are not apprehended.

source: །ན་ཞེས་བྱ་བ་ནི་མིང་དང་བྲལ་ཞིང་། མིང་གི་རང་བཞིན་མ་ཐོབ་མ་སྟོར་བས། ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter na is the gateway to all phenomena, suggesting there are no names and that the intrinsic nature of names cannot be acquired or lost.

source: །ལཱ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་ལས་འདས་ཤིང་། སྲིད་པའི་འཁྲི་ཤིང་དང་རྒྱུ་དང་། རྐྱེན་ཡང་དག་པར་བཅོམ་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter lā is the gateway to all phenomena, suggesting that they are supramundane and that the causes and conditions giving rise to the creeping vine of craving are utterly destroyed.

source: །དཱ་ཞེས་བྱ་བ་ནི་དུལ་བ་དང་དུལ་བའི་གནས་སུ་ཡོངས་སུ་ངེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter dā is the gateway to all phenomena, suggesting that discipline and the disciplined are determined.

source: །བཱ་ཞེས་བྱ་བ་ནི་བཅིངས་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter bā is the gateway to all phenomena, suggesting freedom from bondage.

source: །ཊ་ཞེས་བྱ་བ་ནི་དཀྲུགས་མ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ḍa is the gateway to all phenomena, suggesting freedom from agitation.

source: །ས་ཞེས་བྱ་བ་ནི་ཆགས་པ་མི་དམིགས་པས་ཆགས་པར་མི་འགྱུར་རོ། །འཆིང་བར་མི་འགྱུར་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter sa is the gateway to all phenomena, suggesting that there is no attachment and there is no bondage because attachment is unperceived.

source: །བ་ཞེས་བྱ་བ་ནི་ངག་གི་ལམ་དང་སྒྲ་ཡང་དག་པར་ཆད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter va is the gateway to all phenomena, suggesting that the pathway and sounds of speech have been interrupted.

source: །ཏ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ལས་མ་གཡོས་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ta is the gateway to all phenomena, suggesting that they do not stir from the real nature.

source: །ཡ་ཞེས་བྱ་བ་ནི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དམིགས་སུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ya is the gateway to all phenomena, suggesting that they are definitively nonapprehensible.

source: །སྟ་ཞེས་བྱ་བ་ནི་ཁེངས་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter sta is the gateway to all phenomena, suggesting that boasting is not apprehended.

source: །ཀ་ཞེས་བྱ་བ་ནི་བྱེད་པ་པོ་མི་དམིགས་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ka is the gateway to all phenomena, suggesting that agents are not apprehended.

source: །ས་ཞེས་བྱ་བ་ནི་མཉམ་པ་ཉིད་མི་དམིགས་པས། མཉམ་པ་ཉིད་ལས་མི་འདའ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter sa is the gateway to all phenomena, suggesting that sameness is not transgressed because sameness is not apprehended.

source: །མ་ཞེས་བྱ་བ་ནི་བདག་གིར་བྱ་བ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ma is the gateway to all phenomena, suggesting that the notion of ‘mine’ is not apprehended.

source: །ག་ཞེས་བྱ་བ་ནི་འགྲོ་བ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ga is the gateway to all phenomena, suggesting that motion is not apprehended.

source: །ཐ་ཞེས་བྱ་བ་ནི་གནས་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter stha is the gateway to all phenomena, suggesting that abodes are not apprehended.

source: །ཛཱ་ཞེས་བྱ་བ་ནི་སྐྱེ་བ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter jā is the gateway to all phenomena, suggesting that birth is not apprehended.

source: །ཤྭ་ཞེས་བྱ་བ་ནི་དབུགས་དམིགས་སུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter śva is the gateway to all phenomena, suggesting that the life breath is not apprehended.

source: །དྷ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་དབྱིངས་དམིགས་སུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter dha is the gateway to all phenomena, suggesting that the realm of phenomena is not apprehended.

source: །ཤ་ཞེས་བྱ་བ་ནི་ཞི་གནས་དམིགས་སུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter śa is the gateway to all phenomena, suggesting that stillness is not apprehended.

source: །ཁ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་དང་མཉམ་པས་དམིགས་སུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter kha is the gateway to all phenomena, suggesting that phenomena are not apprehended owing to the sameness of space.

source: །ཀྵ་ཞེས་བྱ་བ་ནི་ཟད་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter kṣa is the gateway to all phenomena, suggesting that extinction is not apprehended. {

source: །སྟ་ཞེས་བྱ་བ་ནི་བསྟོད་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: Dt.213} The letter sta is the gateway to all phenomena, suggesting that eulogies are not apprehended.

source: །ཛྙ་ཞེས་བྱ་བ་ནི་ཡེ་ཤེས་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter jña is the gateway to all phenomena, suggesting that wisdom is not apprehended.

source: །རྟ་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་མི་དམིགས་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter rta is the gateway to all phenomena, suggesting that afflicted mental states are not apprehended.

source: །ཧ་ཞེས་བྱ་བ་ནི་རྒྱུ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ha is the gateway to all phenomena, suggesting that causes are not apprehended.

source: །བྷ་ཞེས་བྱ་བ་ནི་འཇིགས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter bha is the gateway to all phenomena, suggesting that there is no fear.

source: །ཚ་ཞེས་བྱ་བ་ནི་མདོག་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter cha is the gateway to all phenomena, suggesting that complexion is not apprehended.

source: །སྨ་ཞེས་བྱ་བ་ནི་དྲན་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter sma is the gateway to all phenomena, suggesting that memory is not apprehended.

source: །ཧྭ་ཞེས་བྱ་བ་ནི་བོད་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter hva is the gateway to all phenomena, suggesting that appellations are not apprehended.

source: །ཏྶ་ཞེས་བྱ་བ་ནི་མོས་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter tsa is the gateway to all phenomena, suggesting that resolution is not apprehended.

source: །གྷ་ཞེས་བྱ་བ་ནི་སྟུག་པོ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter gha is the gateway to all phenomena, suggesting that density is not apprehended.

source: །ཋ་ཞེས་བྱ་བ་ནི་བསྒྲུབ་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ṭha is the gateway to all phenomena, suggesting that fabrications are not apprehended.

source: །ཎ་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པ་མེད་པས་གང་ཡང་འགྲོ་བ་མེད་ཅིང་འོང་བ་མེད་དེ། གནས་པ་མེད་ཅིང་འདུག་པ་མེད་ལ། ཉལ་བར་འགྱུར་བ་མེད་པས། རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ṇa is the gateway to all phenomena, suggesting that there is neither coming nor going because there is no affliction and there are no conceptual thoughts because there is no standing, sitting, or lying down.

source: །ཕ་ཞེས་བྱ་བ་ནི་འབྲས་བུ་དམིགས་སུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter pha is the gateway to all phenomena, suggesting that fruits are not apprehended.

source: །སྐ་ཞེས་བྱ་བ་ནི་ཕུང་པོ་དམིགས་སུ་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ska is the gateway to all phenomena, suggesting that the psycho-physical aggregates are not apprehended.

source: །ཡས་ཞེས་བྱ་བ་ནི་མི་བདེ་བ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ysa is the gateway to all phenomena, suggesting that the malaise of aging is not apprehended.

source: །ཙ་ཞེས་བྱ་བ་ནི་སྤྱོད་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ca is the gateway to all phenomena, suggesting that conduct is not apprehended.

source: །ཊ་ཞེས་བྱ་བ་ནི་སྡུག་བསྔལ་མི་དམིགས་པ་དང་། མཐར་ཐུག་པར་གནས་པར་འཆི་འཕོ་མེད་ཅིང་། སྐྱེ་བ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ།
en: The letter ṭa is the gateway to all phenomena, suggesting that wails of suffering are not apprehended and that, ultimately, there is neither death and transmigration, nor rebirth.

source: །ཌྷ་ཞེས་བྱ་བ་ནི་གཡོག་པ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། དེ་ཡན་ཅད་ནི་ཡི་གེའི་ཐ་སྙད་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The letter ḍha is the gateway to all phenomena, suggesting that concealment is not apprehended. “

source: དེ་ནི་འདི་ལྟར་གང་ལ་ཡང་གང་གིས་ཐ་སྙད་དུ་བྱ་བ་དང་།
en: The foregoing are not conventional syllables.

source: གང་གིས་བརྗོད་པ་དང་། གང་གིས་བསྟན་པ་དང་། གང་བྲི་བ་དང་། གང་སྣང་བ་དང་། གང་ཀླག་པར་བྱ་བ་དེ་ལྟ་བུའི་མིང་གང་ཡང་མེད་དོ།
en: If you ask why, there exist no names at all by which anything could be conventionally designated, by which anything could be expressed, by which anything could be taught, by which anything could be written, or by which anything could be recited aloud.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ནི་དཔེར་ན། ནམ་མཁའ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ། རབ་འབྱོར་འདི་ནི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ། ཨ་ལ་སོགས་པའི་ཡི་གེ་བསྟན་པ་ལ་འཇུག་པའོ།
en: Subhūti, all phenomena should be understood to resemble space.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས། ཨ་ལ་སྩོགས་པའི་ཡི་གེ་ལ་མཁས་པར་བྱ་བ་འདི་ཡོངས་སུ་ཤེས་ན། དེ་ནི་སྒྲ་གང་ལ་ཡང་ཆགས་པར་མི་འགྱུར་ཞིང་། ཐམས་ཅད་ཆོས་ཉིད་ཀྱིས་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་ཏེ། སྒྲ་ཤེས་པར་བྱ་བ་ལ་མཁས་པ་ཐོབ་པར་འགྱུར་རོ།
en: Subhūti, this is the entrance into the dhāraṇī gateways, the entrance into the demonstration of the letters, beginning with a. Subhūti, if any bodhisattva great beings comprehend this expertise with respect to the letters, beginning with a, they will not be attached to any sounds, they will accomplish all phenomena in accordance with reality, and they will acquire skill in the cognition of sounds.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས། ཨ་ལ་སོགས་པའི་ཡི་གེ་ལ་འཇུག་པའི་ཕྱག་རྒྱ་འདི་དང་། ཨ་ལ་སོགས་པའི་ཡི་གེ་ལ་འཇུག་པའི་ཕྱག་རྒྱའི་ཚིག་འདི་དག་ཐོས་ཏེ། ཐོས་ནས་ཀྱང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་ཅིང་། གཞན་ལ་ཡང་ཚུལ་དང་ལྡན་པའི་བློས་སྟོན་ན། དེ་ལ་ལེགས་པ་ཉི་ཤུ་ཡོད་པར་ཤེས་པར་བྱའོ།
en: Subhūti, if any bodhisattva great beings have heard this seal of introduction to the letters beginning with a, and these words forming the seal of introduction to the letters beginning with a, and, having heard them, also take them up, uphold, recite aloud, master, and with the right understanding teach them to others, they will know that there are twenty advantages.

source: །ཉི་ཤུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་དང་ལྡན། བློ་གྲོས་དང་ལྡན། རྟོགས་པ་དང་ལྡན། བློ་དང་ལྡན།
en: If you ask what these twenty are, they are as follows: (1) They will be mindful, intelligent, understanding, clever, joyful, modest, and inspired. (

source: དགའ་བ་དང་ལྡན། ངོ་ཚ་ཤེས་པ་དང་ལྡན། སྤོབས་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། གཟུངས་ཀྱི་སྒོ་འདི་ཡང་ཉོན་མོངས་པ་མེད་པར་འཐོབ་ཅིང་། ཐེ་ཚོམ་མེད་པར་འགྱུར་ལ།
en: 2) Acquiring this gateway to dhāraṇī without affliction they will be without hesitation. (

source: གཞན་ལས་སྒྲའི་ངག་སྙན་པ་ཐོས་ཀྱང་ཆགས་པར་འགྱུར་བ་མེད་ཅིང་། ཞེ་གཅོད་པའི་ཚིག་ཐོས་ཀྱང་ཁོང་ཁྲོ་བར་མི་འགྱུར་བས། མཐོ་བ་མེད་ཅིང་དམའ་བ་མེད་དེ། ཚུལ་བཞིན་དུ་གནས་པར་འགྱུར་བ་དང་།
en: 3) They will not be attached upon hearing the sweet words of others, nor will they be angered upon hearing harsh words, so that they will stay, appropriately, neither high nor low. (

source: སྒྲ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 4) They will be skilled in words. (

source: ཕུང་པོ་ལ་མཁས་པར་འགྱུར་བ་དང་། ཁམས་ལ་མཁས་པར་འགྱུར་བ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 5) They will be skilled with respect to the psycho-physical aggregates, they will be skilled with respect to the sensory elements, and they will be skilled with respect to the sense fields. (

source: བདེན་པ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 6) They will be skilled with respect to the truths. (

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་ཏེ།
en: 7) They will be skilled with respect to the links of dependent origination. (

source: རྒྱུ་ལ་མཁས་ཤིང་རྐྱེན་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 8) They will be skilled with respect to causes and they will be skilled with respect to conditions. (

source: ཆོས་ཉིད་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 9) They will be skilled with respect to reality. {

source: དབང་པོ་རབ་དང་ཐ་མ་ཤེས་པར་བྱ་བ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: Dt.214} (10) They will be skilled in knowledge of those of high and low acumen. (

source: འཆི་འཕོ་བ་དང་། སྐྱེ་བ་ཤེས་པར་བྱ་བ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 11) They will be skilled in knowledge of death, transmigration, and rebirth. (

source: ལྷའི་རྣ་བའི་ཤེས་པ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 12) They will be skilled in knowledge of clairaudience. (

source: ཕ་རོལ་གྱི་སེམས་ཤེས་པར་བྱ་བ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 13) They will be skilled in knowledge of others’ minds. (

source: སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པར་བྱ་བ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 14) They will be skilled in the knowledge of recollecting past lives. (

source: རྫུ་འཕྲུལ་གྱི་རྣམ་པ་ཤེས་པར་བྱ་བ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 15) They will be skilled in knowledge of miraculous abilities. (

source: ཟག་པ་ཟད་པ་ཤེས་པར་བྱ་བ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 16) They will be skilled in knowledge of the cessation of contaminants. (

source: གནས་དང་གནས་མ་ཡིན་པ་བསྟན་པ་ཤེས་པར་བྱ་བ་མཁས་པར་འགྱུར་བ་དང་།
en: 17) They will be skilled in knowledge of demonstrating that which is possible and that which is impossible. (

source: འགྲོ་བ་ལ་མཁས་ཤིང་ལྡོག་པ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 18) They will be skilled in going out and skilled in returning. (

source: སྤྱོད་ལམ་ལ་མཁས་པར་འགྱུར་བ་དང་།
en: 19) They will be skilled in conduct. (

source: ཁྲེལ་ཡོད་པ་དང་། ངོ་ཚ་ཤེས་པ་ལ་མཁས་པ་ཡང་འཐོབ་པར་འགྱུར་ཏེ།
en: 20) They will also acquire skill in matters of shame and conscience. “

source: རབ་འབྱོར་གཟུངས་ཀྱི་སྒོ་ཨ་ལ་སོགས་པའི་ཡི་གེ་ལ་འཇུག་པ་འདི་ཡང་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Subhūti, [cultivated] without apprehending anything, this introduction to the letters beginning with a, which form the gateway of dhāraṇī, also constitutes the Great Vehicle of bodhisattva great beings.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་དགུ་པའོ།། །།
en: This completes the ninth chapter of “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: རབ་འབྱོར་གང་ཡང་ཁྱོད་འདི་སྐད་དུ་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ཞེས་ཟེར་བ་ནི།
en: Chapter 10 “Subhūti, you asked, ‘How do bodhisattva great beings genuinely enter into the Great Vehicle?’

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ཅིང་། ས་ནས་སར་འཕར་ཏེ།
en: In this regard, Subhūti, bodhisattva great beings practice the six perfections and progress from level to level.

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ཅིང་། ས་ནས་སར་འཕར་བ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་འཕོ་བ་མེད་པས། ཆོས་གང་ཡང་འོང་བ་མེད་ཅིང་།
en: Subhūti, if you ask how bodhisattva great beings practice the six perfections and progress from level to level, it is the case that all phenomena are unchanging, and so there is nothing at all that goes or comes, nothing at all that passes on or draws near.

source: འགྲོ་བ་མེད་དེ། འཕོ་བའམ་ཉེ་བར་འཕོ་བ་མེད་དོ། །འོན་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱིས་གང་ཡིན་པ་དེ་ལ་རློམ་སེམས་སུ་བྱེད་པ་འམ། སེམས་པ་མེད་པར་ས་ཡོངས་སུ་སྦྱོང་བ་ཡང་མི་བྱེད་པ་མ་ཡིན་ལ་ས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: However, while they do not give rise to conceits or think about the level associated with any phenomena, it is not the case that they do not refine the levels, but that they do not observe them. “

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ས་ཡོངས་སུ་སྦྱོང་བ་གང་ཞེ་ན། རབ་འབྱོར་ས་དང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ས་ཡོངས་སུ་སྦྱང་བ་བཅུ་པོ་འདི་དག་བྱ་སྟེ།
en: If you ask what the refinements of the levels are that bodhisattva great beings make, Subhūti, bodhisattva great beings who dwell on the first level should make ten refinements with respect to that level.

source: བཅུ་གང་ཞེ་ན། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལྷག་པའི་བསམ་པ་ལ་སོགས་པ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: If you ask what these ten are, (1) they should refine sincere resolve without apprehending anything. (

source: མཚན་མ་མི་དམིགས་པའི་ཕྱིར། ཕན་པའི་དངོས་པོ་ཡོངས་སུ་སྦྱང་ཞིང་། སེམས་ཅན་མི་དམིགས་པའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 2) They should refine beneficial states owing to their nonapprehension of signs, and they should refine sameness of attitude with regard to all beings owing to their nonapprehension of beings. (

source: སྦྱིན་པ་དང་། གཏོང་བ་དང་། ལེན་པ་མི་དམིགས་པའི་ཕྱིར། གཏོང་བ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 3) They should refine their giving things away owing to their nonapprehension of a gift, a giver, or a recipient. (

source: དེས་རློམ་སེམས་སུ་མི་བྱ་བའི་ཕྱིར། དགེ་བའི་བཤེས་གཉེན་བསྟེན་པ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 4) They should refine the service of spiritual mentors owing to their lack of conceits about them. (

source: ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཕྱིར། ཆོས་བཙལ་བ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 5) They should refine the search for the Dharma owing to their nonapprehension of any phenomena. (

source: ཁྱིམ་མི་དམིགས་པའི་ཕྱིར་ཡང་དང་ཡང་འབྱུང་བ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 6) They should continually refine the departure from home owing to their nonapprehension of a home. (

source: མཚན་དང་། དཔེ་བྱད་བཟང་པོའི་མཚན་མ་མི་དམིགས་པའི་ཕྱིར། སངས་རྒྱས་ཀྱི་སྐུ་ལ་མོས་པ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 7) They should refine the wish for the body of a buddha owing to their nonapprehension of the major and minor marks. (

source: ཆོས་ཀྱི་རྣམ་པ་མི་དམིགས་པའི་ཕྱིར། ཆོས་རྣམ་པར་དབྱེ་བ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 8) They should refine the disclosure of the Dharma owing to their nonapprehension of distinctions in the Dharma. (

source: ཆོས་ཀྱི་ཡང་དག་པ་ཉིད་མི་དམིགས་པའི་ཕྱིར། ང་རྒྱལ་དང་ཁེངས་པ་བསལ་བ་ཡོངས་སུ་སྦྱང་བ་དང་།
en: 9) They should refine the elimination of pride and arrogance owing to their nonapprehension of the true existence of phenomena.

source: ཚིག་མི་དམིགས་པའི་ཕྱིར་བདེན་པའི་ཚིག་ཡོངས་སུ་སྦྱང་བ་སྟེ།
en: And (10) they should refine words of truth owing to their nonapprehension of words.

source: རབ་འབྱོར་ཡོངས་སུ་སྦྱང་བ་བཅུ་པོ་དེ་དག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ས་དང་པོ་ལ་གནས་པས་བྱ་བ་དག་གོ །
en: Subhūti, these are the ten refinements that bodhisattva great beings should maintain on the first level. {

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ས་གཉིས་པ་ལ་གནས་པས། ཆོས་བརྒྱད་པོ་འདི་དག་ཡང་དང་ཡང་ཡིད་ལ་བྱ་ཞིང་། དེ་དག་ལ་ནན་ཏན་དུ་བྱའོ། །བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་དང་། བྱས་པ་ཤེས་ཤིང་དྲིན་དུ་གཟོ་བ་དང་།
en: Dt.215} “Moreover, Subhūti, bodhisattva great beings who dwell on the second level should pay repeated attention to eight attributes and earnestly apply them.
